config/AccumulationRegisters/ПартииЖНВЛС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccumulationRegister>
		<Properties>
			<Name>ПартииЖНВЛС</Name>
			<Comment>Учет по партиям товаров</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Колво</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаЗакупСНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДСЗакуп</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаРознСНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаРознНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Товар</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АССОРТИМЕНТНЫЙ_ПЛАН</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партии</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Фирма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Фирмы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

config/CommonModules/ОМ12_ДляПроведения_Серверный/Ext/Module.bsl
#If SERVER Then
Функция ОМ12_СебестоимостьСП(МСЗСПартиями,ГраницаЭтотДок,ФСс,ССс) Экспорт
	// Назначение:
	// получает данные о себестоимости товара с партиями (ЖНВЛС)
	//--------------------------------------------------------------------------------
	СЗСПартиями= Новый  СписокЗначений;
	СЗСПартиями.ЗагрузитьЗначения(МСЗСПартиями);
	
	ТХТСП="ВЫБРАТЬ
	      |	ПартииЖНВЛСОстатки.Партия КАК Партия,
	      |	СУММА(ПартииЖНВЛСОстатки.КолвоОстаток) КАК Колво,
	      |	СУММА(ПартииЖНВЛСОстатки.СуммаЗакупСНДСОстаток) КАК СуммаЗакупСНДС,
	      |	СУММА(ПартииЖНВЛСОстатки.СуммаНДСЗакупОстаток) КАК СуммаНДСЗакуп,
	      |	СУММА(ПартииЖНВЛСОстатки.СуммаРознСНДСОстаток) КАК СуммаРознСНДС,
	      |	СУММА(ПартииЖНВЛСОстатки.СуммаРознНДСОстаток) КАК СуммаРознНДС,
	      |	ПартииЖНВЛСОстатки.СтавкаНДС КАК СтавкаНДС
	      |ИЗ
	      |	РегистрНакопления.ПартииЖНВЛС.Остатки(
	      |		&ГраницаЭтотДок,
	      |		Склад = &Склад
	      |			И Фирма = &Фирма
	      |			И Партия В (&СписокПартий)) КАК ПартииЖНВЛСОстатки
	      |
	      |СГРУППИРОВАТЬ ПО
	      |	ПартииЖНВЛСОстатки.Партия,
	      |	ПартииЖНВЛСОстатки.СтавкаНДС";
	
	  Запрос= Новый  Запрос;
	
	Запрос.Текст=ТХТСП;
	
	Запрос.УстановитьПараметр("Фирма",ФСс);
	Запрос.УстановитьПараметр("Склад",ССс);
	Запрос.УстановитьПараметр("СписокПартий",СЗСПартиями);
	Запрос.УстановитьПараметр("ГраницаЭтотДок",ГраницаЭтотДок);	   
		   
	Рез=Запрос.Выполнить();	   
	
	ТЗСП=Рез.Выгрузить();
    Возврат ТЗСП;
 КонецФункции
 #КонецЕсли
//============================================================================ GtG ===

Процедура ОМ12_КопияДвиженийПартийВРегистрПоСтавкамНДС(ДокументОбъект,ДвиженияПартий)Экспорт
	  //ДокументОбъект - документ объект, который проводится
	  //ДвиженияПартий - Таблица значений полученная путем выгрузки в нее движений по регистру партий
	  //                 Движения партий на момент использования этой процедуры желательно записать   
	  //------------------------------------------------------------------------------------------------
	 	  
	  ДвиженияПартий.Свернуть("Период,Регистратор,Активность,ВидДвижения,Склад,СтавкаНДС,Фирма,ВидОперации","СуммаЗакупСНДС,СуммаНДСЗакуп,СуммаРознСНДС,СуммаРознНДС");
      ДокументОбъект.Движения.ОстаткиПоСтНДСПоСкладам.Загрузить(ДвиженияПартий);
	  ДокументОбъект.Движения.ОстаткиПоСтНДСПоСкладам.Записать();
	  
КонецПроцедуры
